NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG22/EFR32FG22C121F256GM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PROTIMER_NS</name>
      <version>1</version>
      <description>PROTIMER_NS Registers</description>
      <baseAddress>0xB801C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PROTIMER</name>
        <value>36</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FF33336</resetMask>
          <fields>
            <field>
              <name>DEBUGRUN</name>
              <description>Debug Mode Run Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER is frozen in debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER is running in debug mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMACLRACT</name>
              <description>DMA Request Clear on Active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSMEN</name>
              <description>One-Shot Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Protimer continues to count when WRAP counter overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Protimer stops counting when WRAP counter overflows.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROSTARTEN</name>
              <description>Start from zero enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Protimer starts from the previous count value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Protimer starts counting from zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRECNTSRC</name>
              <description>Selects clock to Pre-counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable Pre-counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Module clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED0</name>
                  <description>Do not use</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED1</name>
                  <description>Do not use</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASECNTSRC</name>
              <description>Selects clock to Base counter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable base counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow events</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED0</name>
                  <description>Do not use</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED1</name>
                  <description>Do not use</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRAPCNTSRC</name>
              <description>Selects clock to Wrap counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable Wrap counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow events</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow events</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED</name>
                  <description>Do not use</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT0SRC</name>
              <description>Selects clock to timeout counter 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow events</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow events</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow events</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT0SYNCSRC</name>
              <description>Select timeout counter 0 event</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No synchronization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT1SRC</name>
              <description>Selects clock to timeout counter 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow events</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow events</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow events</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT1SYNCSRC</name>
              <description>Select timeout counter 1 event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No synchronization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre-counter overflow event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT0MODE</name>
              <description>Repeat Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREE</name>
                  <description>When started, the TOUT0 counts down until it is stopped by software</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONESHOT</name>
                  <description>TOUT0 is stopped after it reaches zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT1MODE</name>
              <description>Repeat Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREE</name>
                  <description>When started, the TOUT1 counts down until it is stopped by software</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONESHOT</name>
                  <description>TOUT1 is stopped after it reaches zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000707F7</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start PROTIMER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTCSYNCSTART</name>
              <description>Start PROTIMER Synchronized with RTCC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop PROTIMER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT0START</name>
              <description>Start Timeout counter 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT0STOP</name>
              <description>Stop Timeout counter 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT1START</name>
              <description>Start Timeout counter 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOUT1STOP</name>
              <description>Stop Timeout counter 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCETXIDLE</name>
              <description>Force to Idle state of tx_state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCERXIDLE</name>
              <description>Force to Idle state of rx_state</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCERXRX</name>
              <description>Force to Rx state of rx_state</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LBTSTART</name>
              <description>LBT sequence start</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LBTPAUSE</name>
              <description>Pause LBT sequence</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LBTSTOP</name>
              <description>LBT sequence stop</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000E0E0E</resetMask>
          <fields>
            <field>
              <name>STARTPRSEN</name>
              <description>Enable Protimer start commands from PRS.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STARTEDGE</name>
              <description>Start Command Edge Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edges detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edges detected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No edge detection, signal is left as it is</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPRSEN</name>
              <description>Enable Protimer stop commands from PRS.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPEDGE</name>
              <description>Stop Command Edge Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edges detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edges detected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No edge detection, signal is left as it is</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCCTRIGGERPRSEN</name>
              <description>Enable RTCC Trigger from PRS.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCTRIGGEREDGE</name>
              <description>RTCC Trigger Edge Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edges detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edges detected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No edge detection, signal is left as it is</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
